content/docs/syllabus.md
+++
title = "Syllabus"
author = ["Mattox Beckman"]
draft = false
weight = 3
date = 2022-08-22
publishdate = 2022-07-01
+++

## Location and Times {#location-and-times}

-   Course Title: Introduction to Programming
-   Rubric: CS 101 KAUST  (It is totally made up....)
-   Dates: January 17th to May 2nd, Tuesdays and Thursdays
-   Time: 14:00 &amp;ndash; 15:15
-   Location: ???
-   Instructor: Mattox Beckman
-   Office Hours: tba


## Objectives and Outcomes {#objectives-and-outcomes}

Upon successfully completing this course, you will be able to program in Python and use it to perform many kinds of tasks.
You won't be an expert at programming, but you will have the skills to learn new things when you need them.


## Class Structure {#class-structure}

The class meets twice a week.  The beginning of the class will have a short group activity based on the POGIL methodology.
Afterwards, the professor will show you a coding demo and give you a short problem to work on with your group.


## Assignments and Grading {#assignments-and-grading}

-   There will be 10 homework sets, collectively worth 70% of the grade.  They will typically be released on Thursday at the end of class,
    and due in 12 days.
-   Attendance will be worth 5%.
-   There will be a final project worth 20%.  You will propose a topic to work on based on your own interests and skills.


## Students with Disabilities {#students-with-disabilities}

To obtain disability-related academic adjustments and/or auxiliary aids,
students with disabilities must contact the course instructor as soon as
possible. To insure that disability-related concerns are properly
addressed from the beginning, students with disabilities who require
assistance to participate in this class should contact disability
resources and educational services
([DRES](https://www.disability.illinois.edu/)) and see the instructor
as soon as possible. If you need accommodations for any sort of
disability, please speak to me after class, or make an appointment to
see me, or see me during my office hours. DRES provides students with
academic accommodations, access, and support services. To contact DRES
you may visit 1207 S. Oak St., Champaign, call 333-4603 (v/tdd), or
e-mail a message to [disability@uiuc.edu](mailto:disability@uiuc.edu).


## Emergency Response Recommendations {#emergency-response-recommendations}

The university police have posted some [emergency response recommendations](http://police.illinois.edu/emergency/). I
encourage you to review this website and the campus building
[floor plans website](http://police.illinois.edu/emergency-preparedness/building-emergency-action-plans/)
within the first 10 days of class.

Of course, since we're all online, your classroom is likely your living space.  Have you considered making
a fire safety plan with your family or roommates?


## Family Educational Rights and Privacy Act (FERPA) {#family-educational-rights-and-privacy-act--ferpa}

Any student who has suppressed their directory information pursuant to family
educational rights and privacy act (FERPA) should self-identify to the
instructor to ensure protection of the privacy of their attendance in this
course. see the [FERPA](http://registrar.illinois.edu/ferpa) site for more information.


## Mental Health {#mental-health}

Diminished mental health, including significant stress, mood changes, excessive
worry, substance/alcohol abuse, or problems with eating and/or sleeping can
interfere with optimal academic performance, social development, and emotional
wellbeing. The University of Illinois offers a variety of confidential services
including individual and group counseling, crisis intervention, psychiatric
services, and specialized screenings at no additional cost. If you or someone
you know experiences any of the above mental health concerns, it is strongly
encouraged to contact or visit any of the University's resources provided below.
Getting help is a smart and courageous thing to do -- for yourself and for those
who care about you.

Counseling Center: 217-333-3704, 610 East John Street Champaign, IL 61820

McKinley Health Center:217-333-2700, 1109 South Lincoln Avenue, Urbana, Illinois 61801

This is where the syllabus will be.
